{
    "name": "Wizard's Study",
    "short_description": "Strange books and papers are scattered across the desk, while your attention is commanded by the small dragon curled up in front of the cold fireplace.",
    "long_description": "Strange rune-covered books and scattered papers cover the large desk, while an assortment of shelves are stocked full of flasks of various sizes with labels that are difficult to read. Though most of your attention is drawn to the small figure of what appears to be a dragon curled up in front of the cold fireplace.",
    "doors": {
        "ornate doorway": {
            "destination": "Astronomy Room",
            "direction": "west",
            "key": "",
            "locked": false,
            "description": "The open doorway is surrounded by ornate golden patterns inlaid with gemstones. The doorway itself seems to shimmer slightly."
        },
        "decorative doorway": {
			"destination": "Washroom",
			"direction": "north",
			"key": "golden key",
			"locked": true,
			"description": "The door is decorated with ornate designs of what appear to be golden flowers. A strange, glowing aura lays across the doorway that seems to ripple like water when you touch it. You notice a keyhole incorporated into the golden design."
		}
    },
    "items": {
        "dragon": {
            "description": "A small winged dragon with multicolored scales. It is sleeping peacefully.",
            "takeable": false,
            "type": "creature"
        },
        "scattered papers": {
            "description": "The majority of the papers seem to indicate various potion recipes.",
            "takeable": false,
            "type": "default"
        },
	"hand-scrawled note": {
            "description": "The note reads: \"Although I let the mushrooms be for the most part, the ones that block passage through the castle are starting to be a problem. I should ask the fairy to make more of the red potion just in case. Also I lost the key to the bathroom again. Have to come up with a better way of making the key without alchemically transmuting a flower into gold.\"",
            "takeable": false,
            "type": "default"
        },
        "crystal sphere": {
            "description": "When you look into the crystal, it appears to constantly shift between various images with little coherency. You step away dizzily.",
            "takeable": false,
            "type": "default"
        },
        "magic 8-ball": {
            "description": "A magic 8-ball. Maybe it lets you see the future?",
            "takeable": true,
            "type": "default"
        },	
        "iron key": {
            "description": "Shimmering with golden light, the iron key has a distinctly swirled shape at the end. You wonder what, if anything, it could unlock.",
            "takeable": true,
            "type": "key"
        }
    }
}
