{
    "name": "Potions Room",
    "short_description": "Ingredients of every kind line the shelves that fill this room. There is a work-table with a few bubbling cauldrons and opened books on it.",
    "long_description": "The room is filled with shelves that hold ingredients of every kind, from dried flowers to moon dust. There is a work-table upon which sit a few bubbling cauldrons and books laid open to specific pages.",
    "doors": {
		"cherry door": {
			"destination": "Kitchen",
			"direction": "east",
			"key": "copper key",
			"locked": false,
			"description": "This aged cherry door has a copper keyhole."
		}
	},
    "items": {
	    "teal gem": {
			"description": "A curious teal-colored gemstone. It is a little smaller than your palm and sparkles beautifully. It has a mysterious glow.",
			"takeable": true,
			"type": "default"
		},
	    "potion rack": {
			"description": "A rack holding bottles for storing potions. Most of them seem cracked, unfortunately.",
			"takeable": true,
			"type": "default"
		},
	    "blue potion": {
			"description": "A vial filled with blue liquid. Other than it's unusual color, there is nothing odd about it. A label on the side tells you not to drink this.",
			"takeable": true,
			"type": "food"
		},
	    "green potion": {
			"description": "A vial of some kind of green liquid. Just by holding it you feel it emanating some sort of energy. You shouldn't drink this.",
			"takeable": true,
			"type": "default"
		},
	    "empty potion bottle": {
			"description": "An empty vial capable of holding potions.",
			"takeable": true,
			"type": "default",
			"hidden": true
		},
	    "annoyed stern-looking ghost": {
	   		"description": "This ghost looks quite annoyed about something. He has a very authoritative look about him as well.",
			"takeable": false,
			"type": "creature"
	    },
	    "stern-looking ghost": {
		    "description": "The authoritative-looking Chief of Ghostly Staff seems a little less annoyed now. Maybe.",
		    "takeable": false,
			"type": "creature",
		    "hidden": true
	    }
	}
}
